FSI/cylinderFlap/OpenFOAM-deal.II/Fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-10;
        relTol           1e-6;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorrFinal
    {
        $p;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          1e-6;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    tolerance 1.0e-14;
    relTol 5e-3;
    pisoTol 1e-6;
    consistent  true;

    nOuterCorrectors 50;

    residualControl
    {
	    U
    	{
    		tolerance 5e-5;
    		relTol	  0;
    	}
	    p
    	{
    		tolerance 5e-4;
    		relTol	  0;
    	}
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
}


// ************************************************************************* //
